/*
*********************************************************************************************************
*	模块名称： 
*	文件名称：
*	说明备注：无
*	修改记录：无
*	版本号     日期          作者     说明
*	V1.0       22-8-1      	贾元文  	 
*********************************************************************************************************
*/
#ifndef __SPI_DRIVER_H
#define __SPI_DRIVER_H

///////////////////////////////////////////////////////////
/*头文件包含区*/
#include "stm32f10x.h"
///////////////////////////////////////////////////////////
/*宏定义区*/

///////////////////////////////////////////////////////////
/*外部变量声明区*/

///////////////////////////////////////////////////////////
/*函数声明区*/
void SPI_Configuration(SPI_TypeDef * SPIx);
int32_t SPI_WriteNBytes(SPI_TypeDef* SPIx, uint8_t *p_TxData,uint32_t sendDataNum);
int32_t SPI_ReadNBytes(SPI_TypeDef* SPIx, uint8_t *p_RxData,uint32_t readDataNum);
int32_t SPI_WriteByte(SPI_TypeDef* SPIx, uint16_t TxData);
int32_t SPI_ReadByte(SPI_TypeDef* SPIx, uint16_t *p_RxData);
///////////////////////////////////////////////////////////
#endif

