/*******************************************************************************
  * 文件：Task.c
  * 作者：https://blog.csdn.net/wanglong3713
  * 版本：v1.0
  * 日期：2021-10-12
  * 说明：时间片轮询各任务
*******************************************************************************/
#include "Timer.h"
#include "Display.h"
#include "Key.h"
#include "DS18B20.h"
#include "DHT11.h"  
#include "esp01s.h"
#include "PID.h"
#include "Debug.h"

/*******************************************************************************
  * 函数名：Task_Init
  * 功  能：初始化
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_Init(void)
{
	Timer_Init();
	//ESP01S_Init();
	//DS18B20_Init();
	DHT11_Init();
	//Display_Init();
	//Key_Init();
	//PID_Init();
}
/*******************************************************************************
  * 函数名：Task_MsProcess
  * 功  能：每ms执行的任务
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_MsProcess(void)
{
	if (Timer_GetMsState() == 1)
	{
		Timer_ClearMsState();
		
		
	}
}
/*******************************************************************************
  * 函数名：Task_2MsProcess
  * 功  能：每2ms执行的任务
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_2MsProcess(void)
{
	if (Timer_Get2MsState() == 1)
	{
		Timer_Clear2MsState();
		
		
	}
}
/*******************************************************************************
  * 函数名：Task_5MsProcess
  * 功  能：每5ms执行的任务
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_5MsProcess(void)
{
	if (Timer_Get5MsState() == 1)
	{
		Timer_Clear5MsState();
		
		
	}
}
/*******************************************************************************
  * 函数名：Task_10MsProcess
  * 功  能：每10ms执行的任务
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_10MsProcess(void)
{
	if (Timer_Get10MsState() == 1)
	{
		Timer_Clear10MsState();
		
		
	}
}
/*******************************************************************************
  * 函数名：Task_20MsProcess
  * 功  能：每20ms执行的任务
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_20MsProcess(void)
{
	if (Timer_Get20MsState() == 1)
	{
		Timer_Clear20MsState();
		
		//Key_Task20Ms();
	}
}
/*******************************************************************************
  * 函数名：Task_50MsProcess
  * 功  能：每50ms执行的任务
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_50MsProcess(void)
{
	if (Timer_Get50MsState() == 1)
	{
		Timer_Clear50MsState();
		
		
	}
}
/*******************************************************************************
  * 函数名：Task_100MsProcess
  * 功  能：每100ms执行的任务
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_100MsProcess(void)
{	
	uint8_t humidity, temperature,station;
	if (Timer_Get100MsState() == 1)
	{
		
		Timer_Clear100MsState();
		station=DHT11_Task(humidity, temperature);
		//printf("station=%d",station);
		//DS18B20_Task100Ms();
		//Display_Task100Ms();
		//PID_Task100Ms();

	}
}
/*******************************************************************************
  * 函数名：Task_200MsProcess
  * 功  能：每200ms执行的任务
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_200MsProcess(void)
{
	if (Timer_Get200MsState() == 1)
	{
		Timer_Clear200MsState();
		
	}
}
/*******************************************************************************
  * 函数名：Task_500MsProcess
  * 功  能：每500ms执行的任务
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_500MsProcess(void)
{
	if (Timer_Get500MsState() == 1)
	{
		Timer_Clear500MsState();
		
		Display_Task500Ms();
	}
}
/*******************************************************************************
  * 函数名：Task_SecProcess
  * 功  能：每Sec执行的任务
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_SecProcess(void)
{
	if (Timer_GetSecState() == 1)
	{
		Timer_ClearSecState();	
		//DS18B20_TaskSec();
		//Display_TaskSec();		
	}
}
/*******************************************************************************
  * 函数名：Task_Control
  * 功  能：任务总控制
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void Task_Control(void)
{
	//Task_MsProcess();
	Task_2MsProcess();
	//Task_5MsProcess();
	//Task_10MsProcess();
	Task_20MsProcess();
	//Task_50MsProcess();
	Task_100MsProcess();
	//Task_200MsProcess();
	Task_500MsProcess();
	Task_SecProcess();
}
/***********************************END OF FILE********************************/