/*******************************************************************************
  * 文件：TM1638.c
  * 作者：whttps://blog.csdn.net/wanglong3713
  * 版本：v1.0
  * 日期：2021-11-20
  * 说明：适用于TM1638驱动的8个数码管、8个LED、8个按键的显示板
			○		○		○		○		○		○		○		○
			LED1	LED2	LED3	LED4	LED5	LED6	LED7	LED8
			
			TUBE1	TUBE2	TUBE3	TUBE4	TUBE5	TUBE6	TUBE7	TUBE8
			
			KEY1	KEY2	KEY3	KEY4	KEY5	KEY6	KEY7	KEY8
  显示板按键顺序实际不一致：
			S1		S5		S2		S6		S3		S7		S4		S8	
*******************************************************************************/
#include "TM1638.h"
//共阴数码管数字段码表
const uint8_t TM1638_TubeNumTab[] =
{
	//0,	1,	2,	3,	4,	   5,	6,   7,  8,   9,    A,   b,  C,   d,   E,   F,  	
	0x3F,0x06,0x5B,0x4F,0x66,0x6D,0x7D,0x07,0x7F,0x6F,0x77,0x7C,0x39,0x5E,0x79,0x71,
	//0., 1.,	2.,	3.,	 4.,  5.,   6.,  7.,  8.,  9. Null
	0xBF,0x86,0xDB,0xCF,0xE6,0xED,0xFD,0x87,0xFF,0xEF,0x00
};
//最左至最右数码管,依次为0-7号,对应的显示寄存器地址
const uint8_t TM1638_TubeAddrTab[] =
{
	0xC0,0xC2,0xC4,0xC6,0xC8,0xCA,0xCC,0xCE
};
//8个led的地址，依次为led1-led8
const uint8_t TM1638_LedAddrTab[] =
{
	0xC1,0xC3,0xC5,0xC7,0xC9,0xCB,0xCD,0xCF
};
/*******************************************************************************
  * 函数名：TM1638_WriteData
  * 功  能：TM1638写数据
  * 参  数：u8Data需要写入的数据
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void TM1638_WriteData(uint8_t u8Data)
{
	uint8_t i;
	TM1638_DIOModeOutput();//DIO设置为输出
	for(i = 0; i < 8; i++)
	{
		TM1638_CLKReset();
		(u8Data & 0x01) ? (TM1638_DIOSet()):(TM1638_DIOReset());
		u8Data >>= 1;
		TM1638_CLKSet();
	}
}
/*******************************************************************************
  * 函数名：TM1638_WriteCmd
  * 功  能：TM1638写命令字
  * 参  数：u8Cmd需要写入的命令
  * 返回值：无
  * 说  明：发送命令字时STB置0,发送完置1
*******************************************************************************/
void TM1638_WriteCmd(uint8_t u8Cmd)
{
	TM1638_STBReset();
	TM1638_WriteData(u8Cmd);
	TM1638_STBSet();
}
/*******************************************************************************
  * 函数名：TM1638_ReadData
  * 功  能：TM1638读数据
  * 参  数：无
  * 返回值：读出的数据
  * 说  明：无
*******************************************************************************/
uint8_t TM1638_ReadData(void)
{
	uint8_t i;
	uint8_t temp=0;
	TM1638_DIOModeInput();//DIO设置为输入
	for(i = 0; i < 8; i++)
	{
		temp >>= 1;
		TM1638_CLKReset();
		if(TM1638_DIORead() == 1)
		{
			temp |= 0x80;			
		}
		TM1638_CLKSet();
	}
	return temp;
}
/*******************************************************************************
  * 函数名：TM1638_ReadKey
  * 功  能：TM1638读按键数据
  * 参  数：无
  * 返回值：读出的数据
  * 说  明：实际该显示板只有8个按键，返回值1~8分别为Key1~Key8;
			所有按键连接K3，无法实现组合按键，只允许一次按一个键；
*******************************************************************************/
uint8_t TM1638_ReadKey(void)
{
	uint8_t u8Data[4], i;
	uint8_t u8Key = 0;
	TM1638_STBReset();
	TM1638_WriteData(0x42);
	for (i = 0; i < 4; i++)
	{
		u8Data[i] = TM1638_ReadData();//读BYTE1~BYTE4的数据
	}
	TM1638_STBSet();
	for (i = 0; i < 4; i++)//取出4个BYTE中的键值
	{
		if (((u8Data[i] >> 0) & 0x01) == 0x01)//第0位，B0,对应按键为1、3、5、7，计算公式是i*2+1
		{
			u8Key = (i * 2 + 1);
			break;
		}else
		{
			if (((u8Data[i] >> 4) & 0x01) == 0x01)//第4位，B4,对应按键为2、4、6、8，计算公式是i*2+2
			{
				u8Key = (i * 2 + 2);
				break;
			}
		}
	}
	return u8Key;
}
/*******************************************************************************
  * 函数名：TM1638_LedDisplay
  * 功  能：8个LED显示
  * 参  数：u8Data每一位代表一个数码管，1亮0灭
  * 返回值：无
  * 说  明：u8Data最高位为最左侧数码管LED1
*******************************************************************************/
void TM1638_LedDisplay(uint8_t u8Data)
{
	uint8_t temp[8],i;	
	for(i = 0; i < 8; i++)
	{
		temp[i] = ((u8Data >> (7 - i)) & 0x01);
		TM1638_STBReset();
		TM1638_WriteData(TM1638_LedAddrTab[i]);//显示地址
		TM1638_WriteData(temp[i]);//显示数据	
		TM1638_STBSet();
	}	
}
/*******************************************************************************
  * 函数名：TM1638_TubeDisplay
  * 功  能：8个数码管显示
  * 参  数：sData显示数据结构体
  * 返回值：无
  * 说  明：共阴极数码管,数据为从右至左顺序
*******************************************************************************/
void TM1638_TubeDisplay(TM1638Tube_ts sData)
{
	uint8_t temp[8],i;
	temp[0] = TM1638_TubeNumTab[sData.tube0];
	temp[1] = TM1638_TubeNumTab[sData.tube1];
	temp[2] = TM1638_TubeNumTab[sData.tube2];
	temp[3] = TM1638_TubeNumTab[sData.tube3];
	temp[4] = TM1638_TubeNumTab[sData.tube4];
	temp[5] = TM1638_TubeNumTab[sData.tube5];
	temp[6] = TM1638_TubeNumTab[sData.tube6];
	temp[7] = TM1638_TubeNumTab[sData.tube7];
	
	for(i = 0; i < 8; i++)
	{
		TM1638_STBReset();
		TM1638_WriteData(TM1638_TubeAddrTab[i]);//地址
		TM1638_WriteData(temp[i]);//数据	
		TM1638_STBSet();
	}	
}
/*******************************************************************************
  * 函数名：TM1638_SetBrightness
  * 功  能：设置亮度
  * 参  数：u8Brt亮度，共8级，0~7
  * 返回值：无
  * 说  明：0x88为开显示
*******************************************************************************/
void TM1638_SetBrightness(uint8_t u8Brt)
{
	TM1638_WriteCmd(0x88 | u8Brt);
}
/*******************************************************************************
  * 函数名：TM1638_Switch
  * 功  能：显示开关
  * 参  数：0关，1开
  * 返回值：无
  * 说  明：0x88为开显示
*******************************************************************************/
void  TM1638_Switch(bool bState)
{
	bState ? TM1638_WriteCmd(0x88) : TM1638_WriteCmd(0x80);
}
/*******************************************************************************
  * 函数名：TM1638_Init
  * 功  能：初始化
  * 参  数：无
  * 返回值：无
  * 说  明：无
*******************************************************************************/
void TM1638_Init(void)
{
	TM1638_DIOModeOutput();//DIO设置为输出
   	TM1638_WriteCmd(0x8B);//亮度
	TM1638_WriteCmd(0x44);//固定地址模式
}
/***********************************END OF FILE********************************/